/*
Напишите программу которая преобразуеть 10тичное число в двоичное
*/

Console.Write("Введи число: ");
double first = Convert.ToInt32(Console.ReadLine());

int Binary(number)
{
    resalt = 0;
    for (int i = number; i > 0; i /= 2)
    {
        for (int j = 0; j < length; j++)
        {
            
        }
        resalt = resalt + number % i;
    }
}
System.Console.WriteLine(int resalt = Binary(first));