/*
Напишите программу для работы с массивом вещественных чисел.
Реализуйте класс  который содержит следующие статические методы:

1. Метод принимает на вход массив вещественных чисел 
array и возвращает максимальное число из массива.

2. Метод принимает на вход массив вещественных 
чисел array и возвращает минимальное число из массива.

3.Метод принимает на вход массив вещественных чисел 
array и возвращает разницу между максимальным и минимальным числами в массиве.

4. Метод для вывода массива на экран. Он принимает на 
вход массив array и выводит его элементы с двумя знаками после запятой через табуляцию.
*/
Console.Clear();

double[] GetDoubleRnd(int size)
{
    double[] array = new double[size];
    for (int i = 0; i < length; i++)
    {
        
    }
}